{
  "@odata.type": "#microsoft.graph.macOSCompliancePolicy",
  "displayName": "macOS Baseline Compliance Policy",  
  "description": "Baseline macOS compliance policy requiring FileVault encryption, Firewall enabled, SIP enabled, and minimum macOS 15.0. Gatekeeper configuration is handled separately via configuration policy.",
  "passwordRequired": false,
  "storageRequireEncryption": true,
  "deviceThreatProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
  "firewallEnabled": true,
  "firewallBlockAllIncoming": false,
  "firewallEnableStealthMode": true,
  "systemIntegrityProtectionEnabled": true,
  "osMinimumVersion": "15.0",
  "managedEmailProfileRequired": false,
  "scheduledActionsForRule": [
    {
      "ruleName": "default",
      "scheduledActionConfigurations": [
        {
          "actionType": "block",
          "gracePeriodHours": 0,
          "notificationTemplateId": null
        }
      ]
    }
  ]
}
