{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-01-16T12:00:00.000Z",
  "creationSource": null,
  "description": "Enables macOS firewall and prevents users from accessing and modifying firewall settings through System Preferences, ensuring firewall configuration remains under IT control.",
  "lastModifiedDateTime": "2025-01-16T12:00:00.000Z",
  "name": "Firewall Configuration",
  "platforms": "macOS",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 2,
  "technologies": "mdm,appleRemoteManagement",
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.preference.security_com.apple.preference.security",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.preference.security_dontAllowFireWallUI",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.preference.security_dontAllowFireWallUI_true",
                  "children": []
                }
              }
            ]
          }
        ]
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.security.firewall_com.apple.security.firewall",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.security.firewall_EnableFirewall",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.security.firewall_EnableFirewall_true",
                  "children": []
                }
              }
            ]
          }
        ]
      }
    }
  ]
}
