{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2025-09-12T10:20:18.689Z",
  "creationSource": null,
  "description": "Comprehensive Gatekeeper and system policy configuration that enables security assessment for downloaded applications, allows identified developers, enables XProtect malware uploads, and prevents users from overriding security policies.",
  "lastModifiedDateTime": "2025-09-12T10:20:18.689Z",
  "name": "Gatekeeper Security Configuration",
  "platforms": "macOS",
  "priorityMetaData": null,
  "roleScopeTagIds": [
    "0"
  ],
  "settingCount": 2,
  "technologies": "mdm,appleRemoteManagement",
  "id": "742193ff-2cab-43a0-b250-3ded9691da1f",
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.systempolicy.control_com.apple.systempolicy.control",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.systempolicy.control_AllowIdentifiedDevelopers",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.systempolicy.control_AllowIdentifiedDevelopers_true",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.systempolicy.control_EnableAssessment",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.systempolicy.control_EnableAssessment_true",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.systempolicy.control_EnableXProtectMalwareUpload",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.systempolicy.control_EnableXProtectMalwareUpload_true",
                  "children": []
                }
              }
            ]
          }
        ]
      }
    },
    {
      "id": "1",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "com.apple.systempolicy.managed_com.apple.systempolicy.managed",
        "settingInstanceTemplateReference": null,
        "groupSettingCollectionValue": [
          {
            "settingValueTemplateReference": null,
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "com.apple.systempolicy.managed_DisableOverride",
                "settingInstanceTemplateReference": null,
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "com.apple.systempolicy.managed_DisableOverride_true",
                  "children": []
                }
              }
            ]
          }
        ]
      }
    }
  ]
}