{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
    "createdDateTime": "2025-09-10T18:17:06.9015983Z",
    "creationSource": null,
    "description": "",
    "lastModifiedDateTime": "2025-09-10T18:17:06.9015983Z",
    "name": "Network Time Protocol",
    "platforms": "macOS",
    "priorityMetaData": null,
    "roleScopeTagIds": [
        "0"
    ],
    "settingCount": 1,
    "technologies": "mdm,appleRemoteManagement",
    "id": "5076ad76-d261-4738-8af6-268793f11a26",
    "templateReference": {
        "templateId": "",
        "templateFamily": "none",
        "templateDisplayName": null,
        "templateDisplayVersion": null
    },
    "settings": [
        {
            "id": "0",
            "settingInstance": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
                "settingDefinitionId": "com.apple.mcx_com.apple.mcx-timeserver",
                "settingInstanceTemplateReference": null,
                "groupSettingCollectionValue": [
                    {
                        "settingValueTemplateReference": null,
                        "children": [
                            {
                                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                                "settingDefinitionId": "com.apple.mcx_timeserver",
                                "settingInstanceTemplateReference": null,
                                "simpleSettingValue": {
                                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue",
                                    "settingValueTemplateReference": null,
                                    "value": "time.apple.com"
                                }
                            }
                        ]
                    }
                ]
            }
        }
    ]
}